# 可读性差一点
# actor = ['胡歌','吴彦祖','梁朝伟','林俊杰','萧敬腾','周杰伦','陈奕迅','沈腾','小岳岳']


# actor = {# key-键         value-值
#     "最喜欢的影视剧演员":['胡歌','吴彦祖','梁朝伟'],
#     "最喜欢的歌手":['林俊杰','萧敬腾','周杰伦'],
#     "最喜欢的喜剧明星":['沈腾','小岳岳']
# }
# print(actor,type(actor),len(actor))

# week = {
#     1:'周一',
#     2:'周二',
#     (6,7):['周六','周天']
# }
# print(week,type(week),len(week))

# 空字典
dit = {}
print(dit,type(dit),len(dit))


week = {
    1:'周一',
    2:'周二',
    2:'周三',  # key重复，不会报错，后面的会覆盖前面，自己定义的不要出现情况
    (6,7):['周六','周天']
}
print(week,type(week),len(week))