# 作业提交形式：py文件。每一题请带上题目，再是代码。一定要代码执行成功之后，再上交py文件。
#
# 题目1：删除如下列表中的"矮穷丑"，写出 2 种或以上方法：
info = ["yuze", 18, "男", "矮穷丑", ["高", "富", "帅"], True, None, "狼的眼睛是啥样的"]
# print(info.pop(3))
# info.remove("矮穷丑")
# print(info)
# ??
# 直接print(info.remove("矮穷丑"))  返回None
# ??
# 题目2：现在有一个列表 li2=[1, 2, 3, 4, 5]，
# 请通过相关的操作改成 li2 =[0, 1, 2, 3, 66, 4, 5, 11, 22, 33]。
# li2=[1, 2, 3, 4, 5]
# li2.insert(0, 0)
# li2.insert(4, 66)
# li3=[11,22,33]
# li2.extend(li3)
# print(li2)
#
# 题目3：下面列表定义正确的是 A、C
# A. ['a' 'b' 'c']
# B. [1:2:3]
# C. [1,[],2.5,'a']

#
# 题目4：有列表如下
# ls = ['心蓝',18,['健身','妹子'],[['刘德华',56],['张学友',57]]]
# 请用列表索引的方式输出'妹子'
# 请用列表索引的方式输出'刘德华'
# print(ls[2][1])
# print(ls[3][0][0])
#
#
# 题目5：有列表如下
# ls = ['b','c']
# 请编写代码在ls的最后添加元素'd'，

# ls.append('d')
# print(ls)
# 请编写代码在ls的开头添加元素'a'
# ls.insert(0, 'a')
# print(ls)
#
#
# 题目6：有列表如下
# ls = ['a','b','c']
# 请编写代码，删除元素'b'
# ls.remove('b')
# print(ls)
#
# 题目7：有列表如下
# ls = ['心蓝',18,['健身','妹子'],[['刘德华',56],['张学友',57]]]
# 请编写代码修改'妹子'替换为'阅读'
# ls[2][1] = "阅读"
# print(ls)
#
#
# 题目8：有列表如下
# ls = [2,1,3]
# # 请编写代码对ls进行从大到小排序
# ls.sort()

#
#
# 题目9：有列表如下
# ls = ['我', '爱', '学', '习', '天', '天', '向', '上']
# 请编写代码将ls中的字符串元素拼接成字符串'我爱学习天天向上'
# print(str(ls).replace("'",'').replace(',',''))
# result = "".join(ls)
# print(result)

# 题目10：简述元组与列表的区别

# 元组是不可变的，而列表是可变的。一旦创建了一个元组，就不能修改它的值，而列表可以通过修改其元素来改变其值。
# 元组通常用于存储不可变的数据，如日期、时间、坐标等。而列表通常用于存储可变的数据，如一组数字、字符串等。
# 元组比列表更快，因为它们不需要额外的内存来存储可变性信息。
#
#
# 题目11：有下面的代码
# a = [[1,2,3],(4,5,6),7,8,9]
# print(len(a))
# 输出正确的是：C
# A. 9
# B. 3
# C. 5
# D. 4
#
# 题目12（字符串和列表）：
# 利用下划线将列表li=["python","java","php"]的元素拼接成一个字符串，然后将所有字母转换为大写
# PYTHON_JAVA_PHP
li=["python","java","php"]
result = "_".join(li)
print(result.upper())