'''格式化输出

1-f字符串'''
'''
==============个人名片===============
姓名：xxx
电话：xxx
职位：xxx
地址：xxxx
====================================
'''

name = input('请输入姓名：')
tel = input('请输入电话：')
job = input('请输入职位：')
addr = input('请输入地址：')

# print(f'''==============个人名片===============
# 姓名：{name}
# 电话：{tel}
# 职位：{job}
# 地址：{addr}
# ====================================''')


'''格式化输出:
2-format字符串'''

print('''==============个人名片===============
姓名：{}
电话：{}
职位：{}
地址：{}
===================================='''.format(name,tel,job,addr))
